# Дано целое число A.
# Проверить истинность высказывания: «Число A является положительным».

A = int(input('Введите число : '))
print(A>0)