# Дано целое число A.
# Проверить истинность высказывания: «Число A является нечетным».

A = int(input('Введите число : '))
print(A%2 != 0)