# Даны два целых числа: A, B.
# Проверить истинность высказывания: «Справедливы неравенства A > 2 и B ≤ 3».

A = int(input('Введите число : '))
B = int(input('Введите число : '))
print(A>2 and B<=3)