# Даны три целых числа: A, B, C.
# Проверить истинность высказывания: «Справедливо двойное неравенство A < B < _C_».

A = int(input('Введите число : '))
B = int(input('Введите число : '))
C = int(input('Введите число : '))

print(A<B<C)