# Дан список [«Ростов», «+», «на», «-», «Дону»].
# Исправьте плюс на дефис и выведите название города
# на экран использовав доступ к элементам списка по индексам.

Mylist = ['Ростов','+','на','-','Дону']
Mylist [1] = '-'
#print(Mylist[:])
print(*Mylist)